IDENTIFICATION DIVISION. *> Compile and run with cobc -std=cobol2014 --free -x day3.cbl && ./day3
PROGRAM-ID. DAY3.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT DAY3DATA ASSIGN TO INPUT
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD DAY3DATA.
    01 RUCKSACK.
        05 CONTENTS PIC X(128).

WORKING-STORAGE SECTION.
77 WS-EOF PIC A(1).
77 WS-CONTENT-POS PIC 9(3).
77 WS-CONTENT-CHAR PIC X(1).
77 WS-LEFT-HALF PIC X(64).
77 WS-RIGHT-HALF PIC X(64).
77 WS-LEFT-COUNTER PIC 9(2).
77 WS-RIGHT-COUNTER PIC 9(2).
77 WS-COMMON PIC X(1).
01 WS-RUCKSACK.
    05 WS-CONTENTS PIC X(128).

PROCEDURE DIVISION.
MAIN-PARA.
    OPEN INPUT DAY3DATA.
        PERFORM UNTIL WS-EOF='Y'
            READ DAY3DATA INTO WS-RUCKSACK
                AT END MOVE 'Y' TO WS-EOF
                NOT AT END

                PERFORM COUNT-LEN-PARA
                MOVE WS-CONTENTS(1:WS-CONTENT-POS / 2) TO WS-LEFT-HALF
                MOVE WS-CONTENTS((WS-CONTENT-POS + 2) / 2:) TO WS-RIGHT-HALF
                PERFORM INTERSECT-PARA
                DISPLAY WS-COMMON
            END-READ
        END-PERFORM.
    CLOSE DAY3DATA.
    STOP RUN.
COUNT-LEN-PARA.
    MOVE 1 TO WS-CONTENT-POS
    PERFORM WITH TEST AFTER UNTIL WS-CONTENT-CHAR = SPACE
        MOVE WS-CONTENTS(WS-CONTENT-POS:1) TO WS-CONTENT-CHAR
        ADD 1 TO WS-CONTENT-POS
    END-PERFORM
    SUBTRACT 2 FROM WS-CONTENT-POS.
INTERSECT-PARA.
    MOVE 1 TO WS-LEFT-COUNTER
    MOVE 1 TO WS-RIGHT-COUNTER
    MOVE SPACE TO WS-COMMON
    PERFORM UNTIL WS-COMMON <> SPACE
        IF (WS-LEFT-HALF(WS-LEFT-COUNTER:1) = WS-RIGHT-HALF(WS-RIGHT-COUNTER:1))
            MOVE WS-LEFT-HALF(WS-LEFT-COUNTER:1) TO WS-COMMON
        END-IF

        IF (WS-LEFT-COUNTER < WS-CONTENT-POS / 2)
            ADD 1 TO WS-LEFT-COUNTER
        ELSE
            MOVE 1 TO WS-LEFT-COUNTER
            ADD 1 TO WS-RIGHT-COUNTER
        END-IF
    END-PERFORM.
